//
// Created by Konstantin Moskalenko on 03.06.2022.
//

#ifndef CL_COURSE_REQUESTS_H
#define CL_COURSE_REQUESTS_H

#include <string>

const std::string requests[] = { // NOLINT(cert-err58-cpp)
        "фильмы 2019",
        "новинки кино 2018",
        "последний богатырь",
        "движение вверх",
        "мстители война бесконечности",
        "веном смотреть онлайн",
        "игра в кальмара смотреть",
        "очень странные дела",
        "топ сериалов netflix",
        "kinopoisk hd",
        "актер том круз",
        "дата выхода человек паук нет пути домой",
        "каннский фестиваль 2018",
        "т 34 фильм 2018 дата выхода",
        "звезды голливуда",
        "игра престолов 8 сезон 1 серия",
        "мстители финал премьера",
        "однажды в голливуде",
        "режиссер фильма движение вверх",
        "режиссёр триллера сияние"
};

#endif //CL_COURSE_REQUESTS_H
