//
// Created by Konstantin Moskalenko on 02.06.2022.
//

#ifndef CL_COURSE_THESAURUS_H
#define CL_COURSE_THESAURUS_H

#include <vector>
#include <string>

struct Descriptor {
    const std::vector<std::string> synset;
    const std::vector<std::string> hyperonym;
    const std::vector<std::string> hyponym;
};

const Descriptor thesaurus[] = { // NOLINT(cert-err58-cpp)
        {{"КИНО", "ФИЛЬМ", "ЛЕНТА"},
         {"КИНОВИДЕОМАТЕРИАЛ", "КИНОВИДЕОПРОДУКЦИЯ", "КИНОВИДЕОПРОИЗВЕДЕНИЕ", "КИНОВИДЕОРОЛИК", "КИНОВИДЕОФИЛЬМ",
          "КИНОМАТЕРИАЛ"},
         {"КОРОТКОМЕТРАЖНЫЙ ФИЛЬМ", "КОРОТКОМЕТРАЖКА", "ВИДЕОПРОИЗВЕДЕНИЕ", "ВИДЕОФИЛЬМ", "КАРТИНА", "КИНОКАРТИНА",
          "КИНОФИЛЬМ", "КИНЕМАТОГРАФИЧЕСКАЯ ПРОДУКЦИЯ", "КИНОЛЕНТА", "КИНОАЛЬМАНАХ", "КИНОПРОИЗВЕДЕНИЕ",
          "КИНОПРОДУКЦИЯ", "КИНОСЕРИАЛ", "КИНЕМАТОГРАФИЧЕСКОЕ ПРОИЗВЕДЕНИЕ", "ПРОДУКЦИЯ КИНОСТУДИЙ", "КИНОЭПОПЕЯ",
          "КИНОРАБОТА", "КИНОШКА", "АНИМАЦИОННЫЙ ФИЛЬМ", "МУЛЬТИПЛИКАЦИОННЫЙ ФИЛЬМ", "МУЛЬТФИЛЬМ", "МУЛЬТИК",
          "МУЛЬТЯШКА", "МУЛЬТИПЛИКАЦИОННОЕ КИНО", "МУЛЬТСЕРИАЛ", "АНИМАЦИОННОЕ КИНО", "НЕИГРОВОЙ ФИЛЬМ",
          "НЕИГРОВОЕ КИНО", "ХУДОЖЕСТВЕННАЯ КАРТИНА", "ХУДОЖЕСТВЕННЫЙ ФИЛЬМ", "ХУДОЖЕСТВЕННОЕ КИНО",
          "ХУДОЖЕСТВЕННЫЙ КИНОФИЛЬМ", "ИГРОВОЙ ФИЛЬМ", "ИГРОВОЕ КИНО", "КИНОПОВЕСТВОВАНИЕ", "КИНОИСТОРИЯ",
          "ТЕЛЕВИЗИОННЫЙ ФИЛЬМ", "ТЕЛЕФИЛЬМ", "МУЗЫКАЛЬНЫЙ ФИЛЬМ", "ПОЛНОМЕТРАЖНЫЙ ФИЛЬМ", "ДОКУМЕНТАЛЬНОЕ КИНО",
          "ДОКУМЕНТАЛЬНЫЙ ФИЛЬМ", "ДОКУМЕНТАЛЬНАЯ КАРТИНА", "ДОКУМЕНТАЛЬНАЯ ЛЕНТА", "СЕРИЯ", "СЕРИЯ ФИЛЬМА",
          "ТЕЛЕСЕРИЯ"}},
        {{"СЕРИАЛ"}, {"РАДИОТЕЛЕПЕРЕДАЧА", "ТЕЛЕРАДИОПЕРЕДАЧА", "ПЕРЕДАЧА"},
         {"ТЕЛЕСЕРИАЛ", "ТЕЛЕВИЗИОННЫЙ СЕРИАЛ", "МНОГОСЕРИЙНЫЙ ФИЛЬМ", "МНОГОСЕРИЙКА", "МЫЛЬНАЯ ОПЕРА"}},
        {{"АКТЕР", "АКТРИСА", "ИСПОЛНИТЕЛЬ РОЛЕЙ", "ЛИЦЕДЕЙ", "ЛИЦЕДЕЙКА", "ИСПОЛНИТЕЛЬНИЦА РОЛИ",
          "СЛУЖИТЕЛЬ МЕЛЬПОМЕНЫ"}, {"АРТИСТ", "АРТИСТКА"},
         {"СТУДИЕЦ", "АКТЕР СТУДИИ", "ПРИМА", "ПРИМА ТЕАТРА", "ВЕДУЩАЯ АКТРИСА", "КИНОАКТЕР", "КИНОАКТРИСА",
          "АРТИСТКА КИНО", "АКТЕР КИНО", "КИНОАРТИСТ", "КИНОАРТИСТКА", "АРТИСТ КИНО", "АКТРИСА КИНО", "СТАТИСТ",
          "СТАТИСТКА", "АКТЕР МАССОВОЙ СЦЕНЫ"}},
        {{"ПРЕМЬЕРА", "ПРЕМЬЕРНЫЙ ПОКАЗ", "ПРЕМЬЕРНОЕ ПРЕДСТАВЛЕНИЕ", "ПРЕМЬЕРНЫЙ СПЕКТАКЛЬ", "ПЕРВОЕ ПРЕДСТАВЛЕНИЕ"},
         {"ПОСТАНОВКА", "ПРЕДСТАВЛЕНИЕ", "ДЕЙСТВО"}, {}},
        {{"РОЛЬ", "АКТЕРСКАЯ РОЛЬ"}, {"ПЕРСОНАЖ", "ДЕЙСТВУЮЩЕЕ ЛИЦО"},
         {"АМПЛУА", "АМПЛУА АКТЕРА", "АКТЕРСКОЕ АМПЛУА", "ТЕАТРАЛЬНОЕ АМПЛУА", "ЭПИЗОДИЧЕСКАЯ РОЛЬ", "ЗАГЛАВНАЯ РОЛЬ",
          "ТИТУЛЬНАЯ РОЛЬ", "КИНОРОЛЬ", "РОЛЬ В КИНО", "РОЛЬ В ФИЛЬМЕ", "РОЛЬ В КАРТИНЕ"}},
        {{"КАРТИНА", "КИНОКАРТИНА", "КИНОФИЛЬМ", "КИНЕМАТОГРАФИЧЕСКАЯ ПРОДУКЦИЯ", "КИНОЛЕНТА", "КИНОАЛЬМАНАХ",
          "КИНОПРОИЗВЕДЕНИЕ", "КИНОПРОДУКЦИЯ", "КИНОСЕРИАЛ", "КИНЕМАТОГРАФИЧЕСКОЕ ПРОИЗВЕДЕНИЕ", "ПРОДУКЦИЯ КИНОСТУДИЙ",
          "КИНОЭПОПЕЯ", "КИНОРАБОТА", "КИНОШКА"}, {"КИНО", "ФИЛЬМ", "ЛЕНТА"},
         {"НЕМОЙ ФИЛЬМ", "НЕМОЕ КИНО", "КИНОЖУРНАЛ", "КИНОКОМЕДИЯ", "ЭКРАНИЗАЦИЯ", "КИНОВЕРСИЯ", "КИНОВАРИАНТ",
          "КИНОПОСТАНОВКА"}},
        {{"ГЕРОЙ", "ГЕРОИНЯ", "ГЕРОЙ ПРОИЗВЕДЕНИЯ", "ГЛАВНЫЙ ГЕРОЙ", "ГЕРОЙ ПОВЕСТОВАНИЯ", "ГЛАВНАЯ ГЕРОИНЯ"},
         {"ПЕРСОНАЖ", "ДЕЙСТВУЮЩЕЕ ЛИЦО"}, {"КИНОГЕРОЙ", "КИНОГЕРОИНЯ", "ГЕРОЙ ФИЛЬМА", "КИНОПЕРСОНАЖ"}},
        {{"СЮЖЕТ", "ФАБУЛА", "СЮЖЕТЕЦ", "СЮЖЕТНАЯ ЛИНИЯ", "ЛИНИЯ СЮЖЕТА", "СЮЖЕТНАЯ НИТЬ", "НИТЬ ПОВЕСТВОВАНИЯ"},
         {"БАЗА", "БАЗИС", "ОСНОВА", "ОСНОВАНИЕ", "СОДЕРЖАНИЕ", "СТЕРЖЕНЬ", "СУТЬ", "СУЩЕСТВО", "СУЩНОСТЬ", "ФУНДАМЕНТ",
          "СУТЬ ДЕЛА", "СУЩЕСТВО ДЕЛА"},
         {"ИНТРИГА", "ИНТРИГУЮЩИЙ СЮЖЕТ", "СЮЖЕТНАЯ ИНТРИГА", "ИНТРИГА СЮЖЕТА", "ИНТРИГА ПРОИЗВЕДЕНИЯ"}},
        {{"КИНОВИДЕОЗРЕЛИЩНОЕ ПРЕДПРИЯТИЕ", "КИНОВИДЕОТЕАТР", "КИНОЗРЕЛИЩНОЕ ПРЕДПРИЯТИЕ", "КИНООРГАНИЗАЦИЯ",
          "КИНОТЕАТР", "КИНОСЕТЬ", "КИНОВИДЕОЗРЕЛИЩНАЯ ОРГАНИЗАЦИЯ", "КИНОЦЕНТР", "КИНОЗРЕЛИЩНАЯ ОРГАНИЗАЦИЯ",
          "КИНОУЧРЕЖДЕНИЕ", "КИНОЗАЛ", "КИНОЗРЕЛИЩНЫЙ ЦЕНТР"},
         {"ЗРЕЛИЩНОЕ УЧРЕЖДЕНИЕ", "ЗРЕЛИЩНОЕ ПРЕДПРИЯТИЕ", "ТЕАТРАЛЬНО-ЗРЕЛИЩНОЕ ПРЕДПРИЯТИЕ",
          "ТЕАТРАЛЬНО-ЗРЕЛИЩНОЕ УЧРЕЖДЕНИЕ"},
         {"МУЛЬТИПЛЕКС", "МНОГОЗАЛЬНЫЙ КИНОТЕАТР", "МУЛЬТИПЛЕКСНЫЙ КИНОТЕАТР", "МЕГАПЛЕКС"}},
        {{"РЕЖИССЕР", "ПОСТАНОВЩИК", "РЕЖИССУРА", "РЕЖИССЕРША", "СОРЕЖИССЕР"},
         {"ДЕЯТЕЛЬ ИСКУССТВА", "РАБОТНИК ИСКУССТВА", "ПРЕДСТАВИТЕЛЬ ИСКУССТВА", "МАЭСТРО", "ЛЮДИ ИСКУССТВА",
          "ДЕЯТЕЛЬНИЦА ИСКУССТВА", "СЛУЖИТЕЛЬ ИСКУССТВА", "СЛУЖИТЕЛЬ МУЗ"},
         {"КИНОРЕЖИССЕР", "РЕЖИССЕР ФИЛЬМА", "ФИЛЬММЕЙКЕР", "РЕЖИССЕР ИГРОВОГО КИНО", "РЕЖИССЕР КИНО",
          "РЕЖИССЕР КАРТИНЫ"}},
        {{"СЕРИЯ", "СЕРИЯ ФИЛЬМА", "ТЕЛЕСЕРИЯ"}, {"КИНО", "ФИЛЬМ", "ЛЕНТА"}, {}},
        {{"КИНЕМАТОГРАФ", "КИНЕМАТОГРАФИЯ", "КИНОИСКУССТВО", "ИСКУССТВО КИНО", "КИНОБИЗНЕС", "КИНОИНДУСТРИЯ",
          "СИНЕМАТОГРАФ", "КИНООТРАСЛЬ", "КИНОКУЛЬТУРА", "КИНОДЕЛО"}, {"ИСКУССТВО", "СФЕРА ИСКУССТВА"},
         {"МУЛЬТИПЛИКАЦИЯ", "АНИМАЦИЯ"}}
};

#endif //CL_COURSE_THESAURUS_H
